import TelegramBot from 'node-telegram-bot-api';
import { config } from './config.js';

/**
 * Инициализация ядра Telegram бота
 * Используем токен из конфига
 */
export const bot = new TelegramBot(config.bot.token, { 
    polling: {
        // ВАЖНО: Не запускаем получение сообщений автоматически!
        // Мы сделаем bot.startPolling() позже, когда база подключится.
        autoStart: true, 
        
        // Оптимизация нагрузки (Senior tuning)
        interval: 300, // Проверять новые сообщения каждые 300мс
        params: { 
            timeout: 10 // Длинный опрос (Long Polling) на 10 сек
        }
    }
});

console.log('🤖 [CORE] Ядро бота инициализировано (режим ожидания).');